## Pandas

In [1]:
import pandas as pd
import numpy as np

### Dataset cleaning

In [2]:
df=pd.read_csv('movies.csv')

In [3]:
df.timestamp=pd.to_datetime(df.timestamp)
df.release_date=pd.to_datetime(df.release_date)

In [4]:
df.rename(columns = {'Western\\':'western'}, inplace = True)
df.western = df.western.replace(to_replace= r'\\', value= '', regex=True)
df.western=df.western.replace(to_replace= r'}', value= '', regex=True)
df.western=df.western.astype(str).astype(int)

In [5]:
df=df.rename(str.lower, axis=1) #axis='columns'

In [6]:
# df.replace(to_replace=[r"\\t|\\n|\\r", "\t|\n|\r"], value=["",""], regex=True, inplace=True)

##### Get shape

In [7]:
'Shape: ',df.shape

('Shape: ', (100000, 30))

### Get colums

In [8]:
df.head(0)
df.columns
df.columns.to_series().groupby(df.dtypes).groups

{dtype('int64'): Index(['user_id', 'movie_id', 'rating', 'unknown', 'action', 'adventure',
        'animation', 'childrens', 'comedy', 'crime', 'documentary', 'drama',
        'fantasy', 'film-noir', 'horror', 'musical', 'mystery', 'romance',
        'sci-fi', 'thriller', 'war', 'western'],
       dtype='object'),
 dtype('<M8[ns]'): Index(['timestamp', 'release_date'], dtype='object'),
 dtype('float64'): Index(['age'], dtype='object'),
 dtype('O'): Index(['gender', 'occupation', 'zip_code', 'movie_title', 'imdb_url'], dtype='object')}

### Select first and last 3 rows

In [9]:
# 1
pd.concat([df.head(3),df.tail(3)])
# 2
pd.concat([df.iloc[0:3],df.iloc[-3:]])
# 3
df.head(3).append(df.tail(3))
# 4
df.iloc[np.r_[0:3, -3:0]] 
#numpy.r_ - Translates slice objects to concatenation along the first axis
#numpy.C_ - Translates slice objects to concatenation along the second axis.

,user_id,movie_id,rating,timestamp,age,gender,occupation,zip_code,movie_title,release_date,...,fantasy,film-noir,horror,musical,mystery,romance,sci-fi,thriller,war,western
0,196,242,3,1970-01-01 00:00:00.881250949,49.0,M,writer,55105,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
1,305,242,5,1970-01-01 00:00:00.886307828,23.0,M,programmer,94086,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
2,6,242,4,1970-01-01 00:00:00.883268170,42.0,M,executive,98101,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
99997,863,1680,2,1970-01-01 00:00:00.889289570,17.0,M,student,60089,Sliding Doors (1998),1998-01-01,...,0,0,0,0,0,1,0,0,0,0
99998,896,1681,3,1970-01-01 00:00:00.887160722,28.0,M,writer,91505,You So Crazy (1994),1994-01-01,...,0,0,0,0,0,0,0,0,0,0
99999,916,1682,3,1970-01-01 00:00:00.880845755,27.0,M,engineer,N2L5N,Scream of Stone (Schrei aus Stein) (1991),1996-08-03,...,0,0,0,0,0,0,0,0,0,0

### Get Dataset Info

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 30 columns):
user_id         100000 non-null int64
movie_id        100000 non-null int64
rating          100000 non-null int64
timestamp       100000 non-null datetime64[ns]
age             93731 non-null float64
gender          100000 non-null object
occupation      93806 non-null object
zip_code        100000 non-null object
movie_title     100000 non-null object
release_date    99991 non-null datetime64[ns]
imdb_url        99987 non-null object
unknown         100000 non-null int64
action          100000 non-null int64
adventure       100000 non-null int64
animation       100000 non-null int64
childrens       100000 non-null int64
comedy          100000 non-null int64
crime           100000 non-null int64
documentary     100000 non-null int64
drama           100000 non-null int64
fantasy         100000 non-null int64
film-noir       100000 non-null int64
horror          100000 non-null int64
musical         100000 non-null int64
mystery         100000 non-null int64
romance         100000 non-null int64
sci-fi          100000 non-null int64
thriller        100000 non-null int64
war             100000 non-null int64
western         100000 non-null int64
dtypes: datetime64[ns](2), float64(1), int64(22), object(5)
memory usage: 22.9+ MB

#### b. State how many rows the dataset has, in addition to this, how many int, float and object variables are present.

#### Count rows

In [11]:
df.shape[0]
df.index

RangeIndex(start=0, stop=100000, step=1)

#### Count variables by data type

In [12]:
df.dtypes.value_counts()

int64             22
object             5
datetime64[ns]     2
float64            1
dtype: int64

### Summary statistics of the dataset

In [13]:
df.describe()

,user_id,movie_id,rating,age,unknown,action,adventure,animation,childrens,comedy,...,fantasy,film-noir,horror,musical,mystery,romance,sci-fi,thriller,war,western
count,100000.00000,100000.000000,100000.000000,93731.000000,100000.0000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,...,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.000000,100000.00000,100000.00000,100000.000000,100000.000000
mean,462.48475,425.530130,3.529860,32.966500,0.0001,0.255890,0.137530,0.036050,0.071820,0.298320,...,0.013520,0.017330,0.053170,0.049540,0.052450,0.194610,0.12730,0.21872,0.093980,0.018540
std,266.61442,330.798356,1.125674,11.561809,0.0100,0.436362,0.344408,0.186416,0.258191,0.457523,...,0.115487,0.130498,0.224373,0.216994,0.222934,0.395902,0.33331,0.41338,0.291802,0.134894
min,1.00000,1.000000,1.000000,7.000000,0.0000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000
25%,254.00000,175.000000,3.000000,24.000000,0.0000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000
50%,447.00000,322.000000,4.000000,30.000000,0.0000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000
75%,682.00000,631.000000,4.000000,40.000000,0.0000,1.000000,0.000000,0.000000,0.000000,1.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.00000,0.00000,0.000000,0.000000
max,943.00000,1682.000000,5.000000,73.000000,1.0000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.00000,1.00000,1.000000,1.000000

In [14]:
df.timestamp.describe()

count                            100000
unique                            49282
top       1970-01-01 00:00:00.891033606
freq                                 12
first     1970-01-01 00:00:00.874724710
last      1970-01-01 00:00:00.893286638
Name: timestamp, dtype: object

In [15]:
df.release_date.describe()

count                   99991
unique                    240
top       1995-01-01 00:00:00
freq                     9932
first     1922-01-01 00:00:00
last      1998-11-02 00:00:00
Name: release_date, dtype: object

In [16]:
df.count()

user_id         100000
movie_id        100000
rating          100000
timestamp       100000
age              93731
gender          100000
occupation       93806
zip_code        100000
movie_title     100000
release_date     99991
imdb_url         99987
unknown         100000
action          100000
adventure       100000
animation       100000
childrens       100000
comedy          100000
crime           100000
documentary     100000
drama           100000
fantasy         100000
film-noir       100000
horror          100000
musical         100000
mystery         100000
romance         100000
sci-fi          100000
thriller        100000
war             100000
western         100000
dtype: int64

#### Get type of the ratings column and display the first 5 rows of the column.

In [17]:
# 1
df["rating"].dtype
# 2
df.rating.dtype

dtype('int64')

In [18]:
# 1
df.rating.head(5)
# 2
df.rating.iloc[:5]
# 3
df[['rating']].head(5)

   rating
0       3
1       5
2       4
3       4
4       3

### Filter out the first 5 rows of users/viewers who are female.

In [19]:
# 1
df[df.gender=='F'].iloc[:5]
# 2
df[df.gender=='F'].head(5)
# 3
# a=pd.DataFrame()
# b=0
# z=0
# for i in df.gender:
#     if i=='F':
#         a=pd.concat([a,df.iloc[b]],axis=1,sort=True)   
#         z+=1
#     if z==5:
#         break
#     b+=1
# a

,user_id,movie_id,rating,timestamp,age,gender,occupation,zip_code,movie_title,release_date,...,fantasy,film-noir,horror,musical,mystery,romance,sci-fi,thriller,war,western
13,18,242,5,1970-01-01 00:00:00.880129305,35.0,F,other,37212,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
18,123,242,5,1970-01-01 00:00:00.879809053,NaN,F,artist,20008,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
19,296,242,4,1970-01-01 00:00:00.884196057,43.0,F,administrator,16803,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
21,270,242,5,1970-01-01 00:00:00.876953744,18.0,F,student,63119,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0
22,240,242,5,1970-01-01 00:00:00.885775683,23.0,F,educator,20784,Kolya (1996),1997-01-24,...,0,0,0,0,0,0,0,0,0,0

#### Get the unique occupations in the dataset:

In [20]:
df.occupation.unique()

array(['writer', 'programmer', 'executive', 'retired', 'marketing',
       'student', 'educator', 'entertainment', 'engineer', 'other', nan,
       'scientist', 'artist', 'administrator', 'lawyer', 'homemaker',
       'librarian', 'healthcare', 'none', 'salesman', 'doctor',
       'technician'], dtype=object)

####  Which is the most common occupation?

In [21]:
df.occupation.mode()

0    student
dtype: object

In [22]:
df.occupation.value_counts().max()

20607

#### Are there any missing values?

In [23]:
df.occupation[df.occupation=='none'].value_counts()

none    847
Name: occupation, dtype: int64

In [24]:
# 1
df.occupation.isna().sum()
# 2
df.occupation.isnull().sum()

6194

### Which is the least common occupation?

In [25]:
df.occupation.value_counts().tail(1)

homemaker    278
Name: occupation, dtype: int64